aacai/Esp32Car/sdkconfig.defaults
# 目标芯片：ESP32-C3（RISC-V）
CONFIG_IDF_TARGET="esp32c3"

# 功能开关
CONFIG_ENABLE_BLE=y

# WiFi 凭据（可改这里或用 menuconfig）
CONFIG_EXAMPLE_WIFI_SSID="your_ssid"
CONFIG_EXAMPLE_WIFI_PASSWORD="your_password"

# 电机 GPIO（L298N，须与 docs/接线文档.md 一致；⚠️ 18/19 是 USB D+/D+，绝对不能用）
CONFIG_MOTOR_IN1_GPIO=1
CONFIG_MOTOR_IN2_GPIO=3
CONFIG_MOTOR_IN3_GPIO=4
CONFIG_MOTOR_IN4_GPIO=5
CONFIG_MOTOR_ENA_GPIO=2
CONFIG_MOTOR_ENB_GPIO=10

# 串口波特率
CONFIG_ESP_CONSOLE_UART_BAUDRATE_115200=y

# 看门狗超时放宽，便于调试
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Bluetooth（ESP32-C3 仅 BLE）
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y

# 分区表：放大 factory 分区以容纳 BLE + HTTP + WiFi 固件
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
